performance-test-reports/main/12532585183/1/user-login/user_login/run.log
-    █ setup

-      █ Given Multiple Users Can access the system

-    █ And [Auth Service] Login Endpoint is accessible

-      █ When more than 10 users are trying to login at the same time

-        ✓ test start time : 2024-12-29T04:51:50Z
-        ✓ request url : http://localhost:5500/client_login
-        ✗ response status : 200
-         ↳  97% — ✓ 331201 / ✗ 6774
-        ✓ response: isJson
-        ✓ Mock N/A
-        ✓ response error : none
-        ✗ response error : 
		status-->0
		error-->read: connection reset by peer
-         ↳  0% — ✓ 0 / ✗ 2101
-        ✗ response error : 
		status-->0
		error-->dial: i/o timeout
-         ↳  0% — ✓ 0 / ✗ 1542
-        ✗ response error : 
		status-->0
		error-->request timeout
-         ↳  0% — ✓ 0 / ✗ 3131

-      █ Then the system should be able to handle the load and respond with status 200

-        ✗ expected response status to equal 200
-         ↳  97% — ✓ 331201 / ✗ 6774
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-      █ And verify the load test client should find the breaking point

-        ✗ expected response status to equal 200
-         ↳  97% — ✓ 331201 / ✗ 6774
-        ✓ has valid json body
-        ✓ expected user login api auth token not to be null

-    _response_errors_cnt...........: 6774    7.815301/s
-    _response_success_cnt..........: 331201  382.113283/s
-    _response_total_cnt............: 337975  389.928584/s
-    checks.........................: 99.32%  ✓ 4001508     ✗ 27096 
-    data_received..................: 117 MB  135 kB/s
-    data_sent......................: 78 MB   90 kB/s
-    dropped_iterations.............: 1624054 1873.703903/s
-    group_duration.................: avg=911.09ms min=235.41µs med=2.51ms   max=1m0s     p(90)=1.27s    p(95)=2.5s    
-    http_req_blocked...............: avg=471.71ms min=0s       med=176.48µs max=19.59s   p(90)=1.03s    p(95)=2.07s   
-    http_req_connecting............: avg=471.65ms min=0s       med=137.88µs max=19.59s   p(90)=1.03s    p(95)=2.07s   
-  ✗ http_req_duration..............: avg=1.2s     min=0s       med=248.1ms  max=59.07s   p(90)=732.11ms p(95)=1.47s   
-      { expected_response:true }...: avg=530.37ms min=1.36ms   med=247.74ms max=58.77s   p(90)=657.38ms p(95)=1.14s   
-  ✗ http_req_failed................: 2.00%   ✓ 6774        ✗ 331201
-    http_req_receiving.............: avg=1.08ms   min=0s       med=88.02µs  max=200.54ms p(90)=1.35ms   p(95)=3.14ms  
-    http_req_sending...............: avg=661.44µs min=0s       med=34.41µs  max=197.7ms  p(90)=211.24µs p(95)=911.63µs
-    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
-    http_req_waiting...............: avg=1.2s     min=0s       med=247.5ms  max=59.07s   p(90)=725.32ms p(95)=1.47s   
-    http_reqs......................: 337975  389.928584/s
-    iteration_duration.............: avg=1.82s    min=3.38ms   med=255.61ms max=1m0s     p(90)=2.5s     p(95)=5.34s   
-    iterations.....................: 337975  389.928584/s
-    vus............................: 2       min=0         max=1000
-    vus_max........................: 1000    min=398       max=1000